In [1]:
import pandas as pd
import duckdb as db
import json
import os

In [2]:
# Load data
root_dir = './data/'
dist_center_df = pd.read_csv(os.path.join(root_dir,'distribution_centers.csv'))
order_items_df = pd.read_csv(os.path.join(root_dir,'order_items.csv'))
orders_df = pd.read_csv(os.path.join(root_dir,'orders.csv'))
products_df = pd.read_csv(os.path.join(root_dir,'products.csv'))
users_df = pd.read_csv(os.path.join(root_dir,'users.csv'))

## VALUE DUPLICATION CHECK

In [3]:
orders_df[orders_df['order_id'].duplicated()]

Empty DataFrame
Columns: [order_id, user_id, status, gender, created_at, returned_at, shipped_at, delivered_at, num_of_item]
Index: []

In [4]:
orders_df.drop_duplicates(subset=['order_id'], keep='last', inplace=True)

In [5]:
users_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 15 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   id              100000 non-null  int64
 1   first_name      100000 non-null  object
 2   last_name       100000 non-null  object
 3   email           100000 non-null  object
 4   age             100000 non-null  int64
 5   gender          100000 non-null  object
 6   state           100000 non-null  object
 7   street_address  100000 non-null  object
 8   postal_code     100000 non-null  object
 9   city            99069 non-null   object
 10  country         100000 non-null  object
 11  latitude        100000 non-null  float64
 12  longitude       100000 non-null  float64
 13  traffic_source  100000 non-null  object
 14  created_at      100000 non-null  object
dtypes: float64(2), int64(2), object(11)
memory usage: 11.4+ MB

In [6]:
users_df.head()

,id,first_name,last_name,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at
0,40112,Robert,Martin,robertmartin@example.com,41,M,Mie,8560 Paul Station Apt. 589,513-0836,Suzuka City,Japan,34.851814,136.508713,Search,2019-03-01 01:22:00 UTC
1,4646,Stephen,Dudley,stephendudley@example.net,60,M,Acre,6531 Dixon Trace,69917-400,Rio Branco,Brasil,-9.945568,-67.835610,Search,2023-02-14 18:56:00 UTC
2,5801,David,Smith,davidsmith@example.com,38,M,Acre,403 Chris Island,69917-400,Rio Branco,Brasil,-9.945568,-67.835610,Search,2023-08-13 00:55:22.961196 UTC
3,22001,Timothy,Anderson,timothyanderson@example.org,14,M,Acre,494 Anna Unions Suite 031,69917-400,Rio Branco,Brasil,-9.945568,-67.835610,Search,2022-12-03 11:15:00 UTC
4,39207,Erik,Johnson,erikjohnson@example.net,21,M,Acre,01619 Jermaine Summit,69917-400,Rio Branco,Brasil,-9.945568,-67.835610,Search,2021-08-21 18:41:00 UTC

In [7]:
def query(sql_query):
    return db.sql(sql_query).df()

In [8]:
null_value = query(
    "SELECT * FROM users_df WHERE city is null"
)
null_value.head()

,id,first_name,last_name,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at
0,9303,Timothy,Edwards,timothyedwards@example.org,51,M,Acre,694 Kyle View,69980-000,None,Brasil,-8.065346,-72.870949,Facebook,2019-08-24 17:55:00 UTC
1,25691,Whitney,Acosta,whitneyacosta@example.net,26,F,Acre,6221 Ethan Stravenue,69980-000,None,Brasil,-8.065346,-72.870949,Search,2020-12-28 01:27:00 UTC
2,35279,Gina,Valenzuela,ginavalenzuela@example.com,21,F,Acre,301 Jillian Highway Apt. 557,69980-000,None,Brasil,-8.065346,-72.870949,Search,2022-12-07 08:44:00 UTC
3,49234,Michelle,Carter,michellecarter@example.com,58,F,Acre,50990 Laurie Plaza,69980-000,None,Brasil,-8.065346,-72.870949,Display,2022-07-12 14:02:00 UTC
4,56982,Benjamin,Ellison,benjaminellison@example.net,19,M,Acre,762 Christopher Mountain Suite 437,69980-000,None,Brasil,-8.065346,-72.870949,Search,2023-08-12 18:18:56.612255 UTC

In [9]:
null_total = query(
    "SELECT latitude, longitude, COUNT(id) as null_total FROM null_value GROUP BY latitude, longitude"
)
null_total

      latitude   longitude  null_total
0   -12.420754  -38.943214           5
1    -1.552182  -47.612929           7
2    -6.771137  -39.290858          13
3    -9.789232  -36.849023          12
4    28.587128  -81.183958           4
..         ...         ...         ...
132 -20.372044  -40.376547           6
133 -15.850637  -48.064887          10
134  35.223806  128.587605           2
135  40.317547   -3.548108           2
136  40.267857   -3.777744           7

[137 rows x 3 columns]

In [10]:
!pip install geopy

Requirement already satisfied: geopy in c:\users\unknown\.pyenv\pyenv-win\versions\3.12.1\lib\site-packages (2.4.1)
Requirement already satisfied: geographiclib<3,>=1.52 in c:\users\unknown\.pyenv\pyenv-win\versions\3.12.1\lib\site-packages (from geopy) (2.0)

[notice] A new release of pip is available: 23.2.1 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [11]:
from geopy.geocoders import Nominatim

In [12]:
null_total.loc[17].to_dict()

{'latitude': 36.66293851, 'longitude': -4.511719984, 'null_total': 2.0}

In [13]:
coor = null_total['latitude'][14], null_total['longitude'][14]
coordinate = f"{coor[0]}, {coor[1]}"
coordinate

'37.33709112, -76.7569565'

In [14]:
geolocator = Nominatim(user_agent="Askar")
location = geolocator.reverse(coordinate)
location.raw

{'place_id': 2765162,
 'licence': 'Data © OpenStreetMap contributors, ODbL 1.0. http://osm.org/copyright',
 'osm_type': 'way',
 'osm_id': 368370843,
 'lat': '37.33644285',
 'lon': '-76.75767138990827',
 'class': 'amenity',
 'type': 'parking',
 'place_rank': 30,
 'importance': 9.99999999995449e-06,
 'addresstype': 'amenity',
 'name': '',
 'display_name': 'Opportunity Way, Marstons Mobile Home Park, Lightfoot, James City County, Virginia, 23090, United States',
 'address': {'road': 'Opportunity Way',
  'hamlet': 'Marstons Mobile Home Park',
  'village': 'Lightfoot',
  'county': 'James City County',
  'state': 'Virginia',
  'ISO3166-2-lvl4': 'US-VA',
  'postcode': '23090',
  'country': 'United States',
  'country_code': 'us'},
 'boundingbox': ['37.3359150', '37.3369451', '-76.7585350', '-76.7569739']}

In [15]:
def search_city(latitude, longitude):
    geolocate = Nominatim(user_agent="Askar")
    coordinates = f"{latitude},{longitude}"
    location = geolocate.reverse(coordinates)
    return location.raw.get('address',{}).get('city')

In [16]:
test = print(search_city(51.76537677, 8.54063881))

None

In [18]:
null_city = list(null_total[['latitude','longitude']].values)
count = 1
city_code = {}
for location in null_city[::-1]:
    location_key = f'{location[0]}/{location[1]}'
    if location_key not in city_code:
        city = search_city(location[0],location[1])
        city_code[location_key] = city
    print(f'Detecting location {count} from {location} --> {city_code[location_key]}')
    count+=1

Detecting location 1 from [40.26785722 -3.77774404] --> Fuenlabrada
Detecting location 2 from [40.31754681 -3.54810806] --> None
Detecting location 3 from [ 35.22380553 128.5876055 ] --> 창원시
Detecting location 4 from [-15.85063718 -48.06488677] --> Taguatinga
Detecting location 5 from [-20.37204429 -40.37654705] --> Cariacica
Detecting location 6 from [ 36.35354657 -78.38609351] --> None
Detecting location 7 from [ -7.45008935 -35.13419726] --> None
Detecting location 8 from [ -3.295962   -43.33373854] --> None
Detecting location 9 from [ -3.28907196 -46.04148814] --> None
Detecting location 10 from [41.6208308   0.65841549] --> Lleida
Detecting location 11 from [ 37.12583037 -76.44706339] --> None
Detecting location 12 from [ 37.47429329 -77.58517125] --> None
Detecting location 13 from [ 38.21639996 -77.42933948] --> None
Detecting location 14 from [ 38.40333075 -77.55210011] --> None
Detecting location 15 from [ 38.6539842  -77.42752508] --> None
Detecting location 16 from [ -1.37238784 -59.98896544] --> None
Detecting location 17 from [ -4.49641675 -69.44996292] --> None
Detecting location 18 from [ -3.77983545 -60.69798501] --> None
Detecting location 19 from [ -6.45813312 -61.4460949 ] --> None
Detecting location 20 from [ -3.7704358  -60.18321229] --> None
Detecting location 21 from [ -3.46271025 -40.1673669 ] --> None
Detecting location 22 from [  1.09683285 -53.30566415] --> None
Detecting location 23 from [ 30.0397354  -95.53316186] --> None
Detecting location 24 from [ -0.26387768 -50.72755912] --> None
Detecting location 25 from [ -1.98197865 -46.43637028] --> None
Detecting location 26 from [ -1.15180429 -51.55505639] --> None
Detecting location 27 from [-11.19130533 -38.20592756] --> None
Detecting location 28 from [-10.00872906 -43.11146705] --> None
Detecting location 29 from [40.30063657 -3.63013198] --> Getafe
Detecting location 30 from [37.96654244 -1.297636  ] --> Murcia
Detecting location 31 from [ 35.20746675 128.6174888 ] --> 창원시
Detecting location 32 from [ 35.33078891 128.6058728 ] --> 창원시
Detecting location 33 from [ 35.12755457 128.4070015 ] --> 창원시
Detecting location 34 from [ 35.24621673 128.5172234 ] --> 창원시
Detecting location 35 from [ 35.24642214 128.5803502 ] --> 창원시
Detecting location 36 from [ 35.22015824 128.5870306 ] --> 창원시
Detecting location 37 from [-15.09858117 -54.21966996] --> Primavera do Leste
Detecting location 38 from [  47.01293084 -120.4138211 ] --> None
Detecting location 39 from [ -8.38591459 -39.33214779] --> None
Detecting location 40 from [-12.07457079 -60.25013809] --> Vilhena
Detecting location 41 from [ -4.61319825 -46.31210541] --> None
Detecting location 42 from [ -3.88872729 -46.40176896] --> None
Detecting location 43 from [ -1.7811512  -45.44588509] --> None
Detecting location 44 from [ 30.6015813  -90.90844271] --> None
Detecting location 45 from [ 39.15271957 -78.2666008 ] --> None
Detecting location 46 from [ 38.92431405 -77.40019841] --> None
Detecting location 47 from [ 42.85326237 -73.78631114] --> None
Detecting location 48 from [ 42.64977256 -82.92919783] --> None
Detecting location 49 from [ 39.79919259 -75.54487279] --> None
Detecting location 50 from [ -7.36241799 -62.4853718 ] --> None
Detecting location 51 from [ -4.95732033 -59.53483513] --> None
Detecting location 52 from [ 39.09494963 117.1617685 ] --> 南开区
Detecting location 53 from [ 33.91067994 -84.17753748] --> None
Detecting location 54 from [ 34.28963847 -84.1799433 ] --> None
Detecting location 55 from [43.31465457 -8.39183398] --> None
Detecting location 56 from [ 29.25152821 -82.27838058] --> None
Detecting location 57 from [ 28.52637649 -81.16841413] --> None
Detecting location 58 from [ 29.92666991 -81.51999261] --> None
Detecting location 59 from [41.71970665 -1.03565974] --> Zaragoza
Detecting location 60 from [41.63925268 -1.01289196] --> Zaragoza
Detecting location 61 from [41.81432529 -0.98303302] --> Zaragoza
Detecting location 62 from [41.69968933 -0.82053939] --> Zaragoza
Detecting location 63 from [-14.23688619 -46.44119622] --> None
Detecting location 64 from [ -5.78530982 -39.75180466] --> None
Detecting location 65 from [ -2.91033387 -48.73693507] --> None
Detecting location 66 from [ -1.53910871 -46.46280701] --> None
Detecting location 67 from [ -4.50292151 -50.27135831] --> None
Detecting location 68 from [ -0.17139828 -55.68836513] --> None
Detecting location 69 from [-11.0299315 -38.7805889] --> None
Detecting location 70 from [-11.2220621  -39.06677052] --> None
Detecting location 71 from [-10.11966196 -41.63020436] --> None
Detecting location 72 from [ -8.06534612 -72.87094866] --> Cruzeiro do Sul
Detecting location 73 from [38.56472288 -0.07042571] --> None
Detecting location 74 from [51.76537677  8.54063881] --> None
Detecting location 75 from [40.26323121 -3.75144759] --> Fuenlabrada
Detecting location 76 from [ 35.30850069 128.6693447 ] --> 창원시
Detecting location 77 from [ 35.24487645 128.6228152 ] --> 창원시
Detecting location 78 from [ 35.14960601 128.4602475 ] --> 창원시
Detecting location 79 from [ 35.26201314 128.5428195 ] --> 창원시
Detecting location 80 from [ 35.23119295 128.5138359 ] --> 창원시
Detecting location 81 from [ 35.22011048 128.5566966 ] --> 창원시
Detecting location 82 from [-15.81979173 -48.04867209] --> None
Detecting location 83 from [-17.49614294 -44.72657541] --> None
Detecting location 84 from [ -8.8984773  -38.30459417] --> None
Detecting location 85 from [  33.65124083 -104.4088569 ] --> None
Detecting location 86 from [37.10557229 -6.14460719] --> None
Detecting location 87 from [ -4.56764248 -44.62088273] --> None
Detecting location 88 from [ -6.08185576 -44.13655113] --> None
Detecting location 89 from [ 38.49229197 -77.49058525] --> None
Detecting location 90 from [ 38.29012809 -77.58309114] --> Fredericksburg
Detecting location 91 from [ 43.15278479 -76.21853975] --> None
Detecting location 92 from [ -3.98827299 -58.60208978] --> None
Detecting location 93 from [ -4.98369385 -58.06006844] --> None
Detecting location 94 from [-26.11110504 -51.07596196] --> None
Detecting location 95 from [ 34.1037362  -84.63757393] --> None
Detecting location 96 from [ 33.93054291 -83.93017996] --> None
Detecting location 97 from [ 33.92175917 -84.06932355] --> None
Detecting location 98 from [ 29.08190242 -82.19775939] --> None
Detecting location 99 from [ 27.79673195 -82.29074849] --> None
Detecting location 100 from [ 30.27358209 -83.05219709] --> None
Detecting location 101 from [41.66213595 -0.80427568] --> Zaragoza
Detecting location 102 from [-16.49602326 -49.43197484] --> None
Detecting location 103 from [ -6.1228195  -39.49550638] --> None
Detecting location 104 from [  31.85214397 -101.9974508 ] --> None
Detecting location 105 from [ 30.11502879 -95.50797393] --> None
Detecting location 106 from [ -2.01114396 -47.23367548] --> None
Detecting location 107 from [ -8.18246152 -49.51257951] --> None
Detecting location 108 from [ -2.1846193  -52.54767639] --> None
Detecting location 109 from [  0.28427266 -53.89325498] --> None
Detecting location 110 from [39.51343958 -0.45571515] --> None
Detecting location 111 from [38.02678296 -1.04698841] --> Murcia
Detecting location 112 from [ 35.3427767 128.7105936] --> 창원시
Detecting location 113 from [ 35.07759286 128.5826292 ] --> 창원시
Detecting location 114 from [ 35.22235631 128.6067193 ] --> 창원시
Detecting location 115 from [-15.83954601 -48.02787743] --> Águas Claras
Detecting location 116 from [ 41.09713803 -75.11602949] --> Middle Smithfield Township
Detecting location 117 from [ 40.1840551  -77.22843111] --> South Middleton Township
Detecting location 118 from [ -8.62632893 -39.91275473] --> None
Detecting location 119 from [ -7.78913976 -35.59356803] --> None
Detecting location 120 from [36.66293851 -4.51171998] --> Málaga
Detecting location 121 from [ -9.20427315 -62.00962206] --> None
Detecting location 122 from [ -4.08732608 -44.14281019] --> None
Detecting location 123 from [ 37.33709112 -76.7569565 ] --> None
Detecting location 124 from [ 28.33645717 -16.67057841] --> None
Detecting location 125 from [ 28.4821279  -16.36715187] --> San Cristóbal de La Laguna
Detecting location 126 from [ -7.06415096 -70.27616355] --> None
Detecting location 127 from [ -8.37532606 -65.81124237] --> None
Detecting location 128 from [ -5.43963104 -70.28538817] --> None
Detecting location 129 from [ -4.43931834 -64.13980634] --> None
Detecting location 130 from [ 33.51797284 -83.93211706] --> None
Detecting location 131 from [ 26.51125329 -80.14993524] --> None
Detecting location 132 from [ 28.18050887 -80.77680577] --> None
Detecting location 133 from [ 28.58712781 -81.18395795] --> None
Detecting location 134 from [ -9.7892323  -36.84902335] --> None
Detecting location 135 from [ -6.77113725 -39.29085807] --> None
Detecting location 136 from [ -1.55218239 -47.61292862] --> None
Detecting location 137 from [-12.42075427 -38.94321438] --> None

In [19]:
import json

with open("city_code.json", "w") as outfile:
    json.dump(city_code, outfile, indent=4)

In [20]:
users_df['filled_data'] = None
users_df.head()

,id,first_name,last_name,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at,filled_data
0,40112,Robert,Martin,robertmartin@example.com,41,M,Mie,8560 Paul Station Apt. 589,513-0836,Suzuka City,Japan,34.851814,136.508713,Search,2019-03-01 01:22:00 UTC,None
1,4646,Stephen,Dudley,stephendudley@example.net,60,M,Acre,6531 Dixon Trace,69917-400,Rio Branco,Brasil,-9.945568,-67.835610,Search,2023-02-14 18:56:00 UTC,None
2,5801,David,Smith,davidsmith@example.com,38,M,Acre,403 Chris Island,69917-400,Rio Branco,Brasil,-9.945568,-67.835610,Search,2023-08-13 00:55:22.961196 UTC,None
3,22001,Timothy,Anderson,timothyanderson@example.org,14,M,Acre,494 Anna Unions Suite 031,69917-400,Rio Branco,Brasil,-9.945568,-67.835610,Search,2022-12-03 11:15:00 UTC,None
4,39207,Erik,Johnson,erikjohnson@example.net,21,M,Acre,01619 Jermaine Summit,69917-400,Rio Branco,Brasil,-9.945568,-67.835610,Search,2021-08-21 18:41:00 UTC,None

In [21]:
filled_city = query(
    "SELECT distinct postal_code, country, city, latitude, longitude, filled_data FROM users_df WHERE city is null"
)
filled_city

    postal_code      country  city   latitude   longitude  filled_data
0     68230-000       Brasil  None   0.284273  -53.893255          NaN
1     68250-000       Brasil  None  -0.171398  -55.688365          NaN
2     68330-000       Brasil  None  -2.184619  -52.547676          NaN
3     68540-000       Brasil  None  -8.182462  -49.512580          NaN
4     69600-000       Brasil  None  -4.496417  -69.449963          NaN
..          ...          ...   ...        ...         ...          ...
132     631-820  South Korea  None  35.149606  128.460248          NaN
133       28524        Spain  None  40.317547   -3.548108          NaN
134       28909        Spain  None  40.300637   -3.630132          NaN
135       28946        Spain  None  40.267857   -3.777744          NaN
136       28947        Spain  None  40.263231   -3.751448          NaN

[137 rows x 6 columns]

In [22]:
with open("city_code.json", "r") as fill_city:
    city_code = json.load(fill_city)
city_code

{'40.26785722/-3.77774404': 'Fuenlabrada',
 '40.31754681/-3.548108063': None,
 '35.22380553/128.5876055': '창원시',
 '-15.85063718/-48.06488677': 'Taguatinga',
 '-20.37204429/-40.37654705': 'Cariacica',
 '36.35354657/-78.38609351': None,
 '-7.450089353/-35.13419726': None,
 '-3.295961998/-43.33373854': None,
 '-3.28907196/-46.04148814': None,
 '41.6208308/0.6584154877': 'Lleida',
 '37.12583037/-76.44706339': None,
 '37.47429329/-77.58517125': None,
 '38.21639996/-77.42933948': None,
 '38.40333075/-77.55210011': None,
 '38.6539842/-77.42752508': None,
 '-1.372387836/-59.98896544': None,
 '-4.496416746/-69.44996292': None,
 '-3.779835447/-60.69798501': None,
 '-6.458133124/-61.4460949': None,
 '-3.770435805/-60.18321229': None,
 '-3.46271025/-40.1673669': None,
 '1.096832853/-53.30566415': None,
 '30.0397354/-95.53316186': None,
 '-0.2638776812/-50.72755912': None,
 '-1.981978652/-46.43637028': None,
 '-1.15180429/-51.55505639': None,
 '-11.19130533/-38.20592756': None,
 '-10.00872906/-43.11146705': None,
 '40.30063657/-3.630131983': 'Getafe',
 '37.96654244/-1.297636002': 'Murcia',
 '35.20746675/128.6174888': '창원시',
 '35.33078891/128.6058728': '창원시',
 '35.12755457/128.4070015': '창원시',
 '35.24621673/128.5172234': '창원시',
 '35.24642214/128.5803502': '창원시',
 '35.22015824/128.5870306': '창원시',
 '-15.09858117/-54.21966996': 'Primavera do Leste',
 '47.01293084/-120.4138211': None,
 '-8.38591459/-39.33214779': None,
 '-12.07457079/-60.25013809': 'Vilhena',
 '-4.613198251/-46.31210541': None,
 '-3.888727287/-46.40176896': None,
 '-1.781151195/-45.44588509': None,
 '30.6015813/-90.90844271': None,
 '39.15271957/-78.2666008': None,
 '38.92431405/-77.40019841': None,
 '42.85326237/-73.78631114': None,
 '42.64977256/-82.92919783': None,
 '39.79919259/-75.54487279': None,
 '-7.362417987/-62.4853718': None,
 '-4.957320329/-59.53483513': None,
 '39.09494963/117.1617685': '南开区',
 '33.91067994/-84.17753748': None,
 '34.28963847/-84.1799433': None,
 '43.31465457/-8.391833982': None,
 '29.25152821/-82.27838058': None,
 '28.52637649/-81.16841413': None,
 '29.92666991/-81.51999261': None,
 '41.71970665/-1.03565974': 'Zaragoza',
 '41.63925268/-1.012891963': 'Zaragoza',
 '41.81432529/-0.9830330243': 'Zaragoza',
 '41.69968933/-0.820539393': 'Zaragoza',
 '-14.23688619/-46.44119622': None,
 '-5.785309816/-39.75180466': None,
 '-2.910333868/-48.73693507': None,
 '-1.539108709/-46.46280701': None,
 '-4.502921513/-50.27135831': None,
 '-0.1713982778/-55.68836513': None,
 '-11.0299315/-38.7805889': None,
 '-11.2220621/-39.06677052': None,
 '-10.11966196/-41.63020436': None,
 '-8.065346116/-72.87094866': 'Cruzeiro do Sul',
 '38.56472288/-0.07042570698': None,
 '51.76537677/8.540638813': None,
 '40.26323121/-3.751447593': 'Fuenlabrada',
 '35.30850069/128.6693447': '창원시',
 '35.24487645/128.6228152': '창원시',
 '35.14960601/128.4602475': '창원시',
 '35.26201314/128.5428195': '창원시',
 '35.23119295/128.5138359': '창원시',
 '35.22011048/128.5566966': '창원시',
 '-15.81979173/-48.04867209': None,
 '-17.49614294/-44.72657541': None,
 '-8.898477299/-38.30459417': None,
 '33.65124083/-104.4088569': None,
 '37.10557229/-6.144607188': None,
 '-4.567642479/-44.62088273': None,
 '-6.081855758/-44.13655113': None,
 '38.49229197/-77.49058525': None,
 '38.29012809/-77.58309114': 'Fredericksburg',
 '43.15278479/-76.21853975': None,
 '-3.988272986/-58.60208978': None,
 '-4.983693852/-58.06006844': None,
 '-26.11110504/-51.07596196': None,
 '34.1037362/-84.63757393': None,
 '33.93054291/-83.93017996': None,
 '33.92175917/-84.06932355': None,
 '29.08190242/-82.19775939': None,
 '27.79673195/-82.29074849': None,
 '30.27358209/-83.05219709': None,
 '41.66213595/-0.8042756789': 'Zaragoza',
 '-16.49602326/-49.43197484': None,
 '-6.122819502/-39.49550638': None,
 '31.85214397/-101.9974508': None,
 '30.11502879/-95.50797393': None,
 '-2.011143963/-47.23367548': None,
 '-8.182461523/-49.51257951': None,
 '-2.184619301/-52.54767639': None,
 '0.2842726631/-53.89325498': None,
 '39.51343958/-0.4557151479': None,
 '38.02678296/-1.046988412': 'Murcia',
 '35.3427767/128.7105936': '창원시',
 '35.07759286/128.5826292': '창원시',
 '35.22235631/128.6067193': '창원시',
 '-15.83954601/-48.02787743': 'Águas Claras',
 '41.09713803/-75.11602949': 'Middle Smithfield Township',
 '40.1840551/-77.22843111': 'South Middleton Township',
 '-8.626328933/-39.91275473': None,
 '-7.789139764/-35.59356803': None,
 '36.66293851/-4.511719984': 'Málaga',
 '-9.204273145/-62.00962206': None,
 '-4.087326077/-44.14281019': None,
 '37.33709112/-76.7569565': None,
 '28.33645717/-16.67057841': None,
 '28.4821279/-16.36715187': 'San Cristóbal de La Laguna',
 '-7.064150959/-70.27616355': None,
 '-8.375326062/-65.81124237': None,
 '-5.439631041/-70.28538817': None,
 '-4.439318343/-64.13980634': None,
 '33.51797284/-83.93211706': None,
 '26.51125329/-80.14993524': None,
 '28.18050887/-80.77680577': None,
 '28.58712781/-81.18395795': None,
 '-9.789232303/-36.84902335': None,
 '-6.771137246/-39.29085807': None,
 '-1.552182394/-47.61292862': None,
 '-12.42075427/-38.94321438': None}

In [23]:
users_df['filled_data'] = users_df.apply(
    lambda x: city_code.get(f"{x['latitude']}/{x['longitude']}", None) if pd.isnull(x["city"])
    else (x["city"]), axis=1
)

In [24]:
new_data = query(
    "SELECT distinct postal_code, city, country, latitude, longitude, filled_data FROM users_df WHERE city is null"
)
new_data

    postal_code  city      country   latitude   longitude filled_data
0     68230-000  None       Brasil   0.284273  -53.893255        None
1     68330-000  None       Brasil  -2.184619  -52.547676        None
2     68540-000  None       Brasil  -8.182462  -49.512580        None
3     68695-000  None       Brasil  -2.910334  -48.736935        None
4     69190-000  None       Brasil  -4.983694  -58.060068        None
..          ...   ...          ...        ...         ...         ...
132       29142  None       Brasil -20.372044  -40.376547   Cariacica
133     630-490  None  South Korea  35.223806  128.587605         창원시
134     630-850  None  South Korea  35.231193  128.513836         창원시
135       30835  None        Spain  37.966542   -1.297636      Murcia
136       28524  None        Spain  40.317547   -3.548108        None

[137 rows x 6 columns]

In [25]:
query(
    "SELECT * FROM products_df WHERE name is null"
)

,id,cost,category,name,brand,retail_price,department,sku,distribution_center_id
0,24455,67.335453,Outerwear & Coats,None,Tru-Spec,147.990005,Men,B290A635641F585B3DD6B95FD42DC267,2
1,12586,18.972000,Intimates,None,Josie by Natori,36.000000,Women,A7EA034186E14FB5F7B37CF664893CD2,1

In [26]:
products_df[products_df.isnull().any(axis=1)]

,id,cost,category,name,brand,retail_price,department,sku,distribution_center_id
173,27543,19.872000,Swim,Harbor Bay Big & Tall Swim Rash Guard,NaN,36.000000,Men,50E9EA9C1BC5E6067AB7C0D8FBDD5F21,3
174,27640,29.353500,Swim,O'Neill Hangover Boardshorts,NaN,49.500000,Men,42ADA6A116005062613A49ADD8AB908B,3
1085,21207,30.754350,Jeans,Ariat 9424 Men's M4 Low Rise Boot Tumbled,NaN,59.950001,Men,A59687B426E9EB30465997EB54862A2E,3
1086,21484,30.285500,Jeans,True Nation Big & Tall Relaxed-Fit Jeans,NaN,59.500000,Men,64C32B8EB5304D80BA093227975ECE13,3
3339,25135,12.476400,Socks,Volcom Men's Argyle Socks,NaN,22.480000,Men,0DC76D68D436BB030EFBE3A8386EE47A,3
3340,25187,14.425000,Socks,SockGuy Men's Kokopelli Socks,NaN,25.000000,Men,43A4D135B5225238F2ADBF88DC810A6B,3
8837,16309,11.520000,Tops & Tees,Hurley Men's One and Only Short Sleeve Tee,NaN,20.000000,Men,88E0F16114A1E011C87B797513095A20,3
8838,16559,14.944250,Tops & Tees,Gildan Adult Ultra CottonTM Sleeveless T-Shirt,NaN,25.990000,Men,DC0FC2D90D6102BA02D0206857EAAC51,3
8839,16898,13.925000,Tops & Tees,Quiksilver Waterman Men's On The Rise,NaN,25.000000,Men,22811EE19846217512507785E74D12CC,3
9961,27288,12.726610,Sleep & Lounge,White and Black Check Dot VIP Flannel Pants fo...,NaN,28.990000,Men,97FB74BBDD02677ADC1A871FDD16AC7A,3
10713,24455,67.335453,Outerwear & Coats,NaN,Tru-Spec,147.990005,Men,B290A635641F585B3DD6B95FD42DC267,2
10753,23769,18.540000,Outerwear & Coats,Stormtech Men's Chinook Fleece Vest,NaN,45.000000,Men,1C51851B7A12EED5C6DDBEE10E6EA94C,3
10754,24287,39.488049,Outerwear & Coats,Adidas Men's Hiking Hooded 1Side Fleece Jacket,NaN,89.949997,Men,9F62C81D7B48E146423F79C9E151510D,3
13377,15723,4.875120,Plus,Vintage Wayfarer Nerd Retro 80s Mirrored Sungl...,NaN,9.990000,Women,67F19FD0431CAC0AC7F8EA986BBF8B9B,3
13378,15757,2.235510,Plus,NEW Aluminum Credit Card Wallet - RFID Blockin...,NaN,4.210000,Women,054826216783428249A279BA5B984315,3
20171,12586,18.972000,Intimates,NaN,Josie by Natori,36.000000,Women,A7EA034186E14FB5F7B37CF664893CD2,1
20748,10598,9.616400,Intimates,JMS Comfort Lace with Hidden Shaper,NaN,16.580000,Women,E6FA05C07B144B6FF4D1FD1CD2BBB244,3
20749,11389,12.512000,Intimates,Shadowline 36 Flare Half Slip (47116),NaN,23.000000,Women,47C6D232C6A4468118A74A72097B1876,3
20750,11668,18.662401,Intimates,Everyday Comfort Cami,NaN,38.400002,Women,67E4423AFD0FFD2F451890C0888E6F33,3
20751,11843,33.900000,Intimates,Wendy Glez Rose Cami Black,NaN,60.000000,Women,B451DA363BB08B9A81CEADBADB5133EF,3
23514,13863,9.554500,Accessories,Husky Animal Hat with Mittens,NaN,24.250000,Women,7992308D89FF6B43BC197C8EF9BD934B,3
23515,13921,1.641900,Accessories,NEW Aluminum Credit Card Wallet - RFID Blockin...,NaN,4.210000,Women,0CBFF6DD75DF1F43E3ABAE409ED8A9FD,3
24190,755,15.140850,Tops & Tees,The Very Hungry Caterpillar Classic Book Women...,NaN,28.950001,Women,CCB0989662211F61EDAE2E26D58EA92F,3
26486,9482,5.712000,Socks & Hosiery,KEEN Women Bellingham Low Ultralite Sock,NaN,16.000000,Women,C5A3C867A3DFB776552DCFC804D4937E,3
27608,8600,16.015551,Outerwear & Coats,Women's Micro Fleece Vest (up to size 4X),NaN,35.990002,Women,CE840AA9583592E71F3DB26EE6E41703,3
28472,1629,23.572350,Fashion Hoodies & Sweatshirts,Carhartt Women's Hooded Knit Jacket,NaN,45.950001,Women,5C50B4DF4B176845CD235B6A510C6903,3

In [27]:
query(
    "SELECT * FROM products_df WHERE name is null"
)

,id,cost,category,name,brand,retail_price,department,sku,distribution_center_id
0,24455,67.335453,Outerwear & Coats,None,Tru-Spec,147.990005,Men,B290A635641F585B3DD6B95FD42DC267,2
1,12586,18.972000,Intimates,None,Josie by Natori,36.000000,Women,A7EA034186E14FB5F7B37CF664893CD2,1

In [28]:
products_df['name'] = products_df['name'].fillna('Unknown')
products_df[products_df['id'].isin([24455,12586])]

,id,cost,category,name,brand,retail_price,department,sku,distribution_center_id
10713,24455,67.335453,Outerwear & Coats,Unknown,Tru-Spec,147.990005,Men,B290A635641F585B3DD6B95FD42DC267,2
20171,12586,18.972000,Intimates,Unknown,Josie by Natori,36.000000,Women,A7EA034186E14FB5F7B37CF664893CD2,1

In [29]:
products_df['retail_price'].min()

0.0199999995529651

In [30]:
mode = products_df['retail_price'].mode()

In [31]:
products_df['retail_price'] = products_df['retail_price'].fillna(mode)

## VALUE VALIDITY CHECK

In [32]:
products_df.query("retail_price <= 0")

Empty DataFrame
Columns: [id, cost, category, name, brand, retail_price, department, sku, distribution_center_id]
Index: []

In [33]:
order_items_df.query("sale_price <= 0")

Empty DataFrame
Columns: [id, order_id, user_id, product_id, inventory_item_id, status, created_at, shipped_at, delivered_at, returned_at, sale_price]
Index: []